<script setup lang="ts">
const list = [
  "那：",
  "梦想的旅途",
  "我背井离乡",
  "肩上扛的",
  "装着对未来的梦想",
  "我和你们一样",
  "也来自远方",
  "做着普通的工作",
  "在外漂泊思乡",
  "有多少人都希望",
  "自己的生活",
  "能过得好一点",
  "能改变自己的历史",
  "让父母的压力小一点",
  "每逢过节的时候",
  "少不了对父母的那份思念",
  "不能回家因为自己的梦想",
  "还没有实现",
  "他们的坚强他们的梦",
  "他们的苦只有自己懂",
  "回不到曾经看不到未来",
  "一切都是那么的空",
  "还要一直拼命地走着",
  "用尽全力奋斗着",
  "然而这也是我的生活",
  "在梦想之途前进着",
  "拿起了电话说",
  "妈妈我还好",
  "我回到了现实",
  "继续解决我的温饱",
  "我被别人说好",
  "也被别人嘲笑",
  "但从没被现实打倒",
  "这就是北漂",
  "尤：",
  "我飘向北方",
  "别问我家乡",
  "那：",
  "别问我家乡",
  "尤：",
  "高耸古老的城墙",
  "挡不住忧伤",
  "我飘向北方",
  "那：",
  "我飘向北方",
  "尤：",
  "家人是否无恙",
  "那：",
  "我梦在前方",
  "尤：",
  "肩上沉重的行囊",
  "盛满了惆怅",
  "也是最后期望",
  "那：",
  "随便你叫我",
  "来自火星还是来自地球",
  "生活在张牙舞爪的世界",
  "我要拼到尽头",
  "尤：",
  "回不去的远方",
  "那：",
  "每天的祷告",
  "让我毅力变得如此宽厚",
  "我要踏着力气",
  "奋斗穿破整个宇宙",
  "他们都叫我",
  "不如叫我Mr.King",
  "夺走我的皇冠",
  "也不敢抢走我的自信",
  "If you wanna stay with me",
  "我给你一臂之力",
  "打破僵局在地平线",
  "只有我和你",
  "我踏着你的肩膀",
  "走在战场的前方",
  "用气场去压倒着haters的迹象",
  "不喜欢退缩",
  "因为血性冷落",
  "一场战争怎么能取得胜利",
  "如果没有我",
  "看 王者的战旗",
  "尤：",
  "忍着泪",
  "那：",
  "在国度里升起",
  "尤：",
  "掩着伤",
  "那：",
  "我看见许多双手挥起了手臂",
  "尤：",
  "抬头看着斜阳",
  "那：",
  "请用尽全力高喊Mr.King",
  "尤：",
  "抬头看着斜阳",
  "那：",
  "我的梦在哪里",
  "我就漂在哪里",
  "尤：",
  "亲爱的",
  "那：",
  "Fighting war",
  "只有奋斗才能改变命运",
  "尤：",
  "在远方",
  "那：",
  "Fighting war",
  "王者的风范现在说给你听",
  "尤：",
  "那：",
  "Fighting war",
  "在我意识里只有胜利没有放弃",
  "尤：",
  "太迷惘",
  "我飘向北方",
  "那：",
  "我飘向北方",
  "尤：",
  "别问我家乡",
  "那：",
  "我梦在前方",
  "尤：",
  "高耸古老的城墙",
  "挡不住忧伤",
  "我飘向北方",
  "那：",
  "我飘向北方",
  "尤：",
  "家人是否无恙",
  "那：",
  "我梦在前方",
  "尤：",
  "肩上沉重的行囊",
  "盛满了惆怅",
  "也是最后期望",
  "那：",
  "从2005到2018",
  "从模仿到原创到潜能激发",
  "新疆到北京我一路急刹",
  "夸赞被嘲笑但从被击垮",
  "尤：",
  "回不去的远方",
  "那：",
  "拼了老命 养活一家",
  "脑里只有Hip-Hop没尽头",
  "无数张",
  "在家里挤压",
  "趴下了也从未被谁欺压",
  "Call me Lil EM",
  "From the west",
  "现在炫给你看",
  "技术来记录",
  "这押韵的密度",
  "我意图来吸附",
  "你灵魂的脊柱",
  "别低估我力度",
  "我企图玩艺术",
  "却迷路在起步",
  "记住我的去处",
  "必须跟你叙述",
  "技术在灵魂面前必输",
  "Hands up everybody",
  "尤：",
  "我飘向北方",
  "那：",
  "随便你叫我",
  "来自火星还是来自地球",
  "生活在张牙舞爪的世界",
  "我要拼到尽头",
  "每天的祷告",
  "让我毅力变得如此宽厚",
  "我要踏着力气",
  "尤：",
  "挡不住忧伤",
  "那：",
  "奋斗穿破整个宇宙",
  "他们都叫我Mr.Mars",
  "不如叫我Mr.King",
  "尤：",
  "家人是否无恙",
  "那：",
  "夺走我的皇冠",
  "也不敢抢走我的自信",
  "If you wanna stay with me",
  "我给你一臂之力",
  "打破僵局在地平线",
  "合：",
  "只有我和你",
  "尤：",
  "那是最后期望",
  "回不去的远方",
  "那：",
  "我的梦在哪里",
  "我就飘在哪里",
  "如果你们有梦想",
  "放开的去追",
  "尤：",
  "别再问我家乡",
  "那：",
  "因为只有奋斗",
  "才能改变命运",
  "Peace"
]
</script>

<template>
  <div class="show">
    <p v-for="item in list">{{ item }}</p>
    <p>
      <span>梦想的旅途</span>
    </p>
  </div>
</template>

<style scoped lang="less">
@keyframes textAnimation {
  0% {
    transform: translate(-300%);
  }
  50% {
    transform: translate(0);
  }
  100% {
    transform: translate(500%);
  }
}

.show {
  width: 100%;
  height: 100%;
  background-color: #000;
  overflow: auto;
  font-family: HuiMo, sans-serif;
  text-align: center;
  color: rgb(202, 231, 129);
  font-size: 35px;
  text-shadow: 2px 2px 3px #c24f4f; /* 水平阴影，垂直阴影，模糊的距离 阴影的颜色 */

  p {
    margin-top: 10px;
    overflow: hidden;

    span {
      display: inline-block;
      //animation: textAnimation 2.5s 0.1s cubic-bezier(0.42, 0, 0, 0.52) forwards;
      will-change: transform;
    }
  }
}
</style>